CREATE TABLE type (
    id serial PRIMARY KEY,
    name varchar(255)
);

CREATE TABLE product (
    id serial PRIMARY KEY,
    name varchar(255),
    type_id int REFERENCES type(id),
    expired_date date,
    price numeric(10,4)
);

INSERT INTO type
VALUES
    ('1', 'Кисломолочные продукты'),
    ('2', 'Мясо'),
    ('3', 'Хлебобулочные изделия'),
    ('4', 'Конфеты'),
    ('5', 'Печенья'),
    ('6', 'Бакалея'),
    ('7', 'Хозтовары'),
    ('8', 'Сыр'),
    ('9', 'Заморозка');

INSERT INTO product
VALUES
    ('1', 'Кефир', '1', '2022-08-02', '89'),
    ('2', 'Йогурт', '1', '2022-08-07', '45'),
    ('3', 'Сметана', '1', '2022-07-20', '76'),
    ('4', 'Сырок глазированный', '1', '2022-09-02', '80'),
    ('5', 'Говядина', '2', '2022-08-12', '786'),
    ('6', 'Филе куриное', '2', '2022-07-20', '432'),
    ('7', 'Индейка', '2', '2022-08-25', '488'),
    ('8', 'Плюшка московская', '3', '2022-07-25', '56'),
    ('9', 'Слойка свердловская', '3', '2022-07-25', '32'),
    ('10', 'Шоколадка Аленка', '4', '2022-09-25', '78'),
    ('11', 'Киндер сюрприз', '4', '2022-07-01', '120'),
    ('12', 'Леденцы', '4', '2022-12-25', '34'),
    ('13', 'Орион чокопай', '5', '2022-10-25', '180'),
    ('14', 'Печенье овсянное', '5', '2022-09-05', '120'),
    ('15', 'Печенье американское', '5', '2022-09-06', '150'),
    ('16', 'Гречка', '6', '2023-02-25', '100'),
    ('17', 'Рис', '6', '2023-05-22', '105'),
    ('18', 'Макароны', '6', '2023-04-12', '40'),
    ('19', 'Чай черный крупнолистовой', '6', '2023-02-25', '230'),
    ('20', 'Кофе зерновой', '6', '2023-01-21', '998'),
    ('21', 'Скотч', '7', '2023-01-21', '167'),
    ('22', 'Клей момент', '7', '2021-01-21', '122'),
    ('23', 'Изолента синяя', '7', '2050-01-01', '50'),
    ('24', 'Батарейка AAA', '7', '2022-07-21', '300'),
    ('25', 'Порошок стиральный', '7', '2023-01-31', '500'),
    ('26', 'Моцарелла', '8', '2022-09-30', '400'),
    ('27', 'Маасдам', '8', '2022-10-21', '300'),
    ('28', 'Гауда', '8', '2022-11-25', '350'),
    ('29', 'Российский', '8', '2022-09-30', '200'),
    ('30', 'Фасоль', '9', '2023-01-31', '200'),
    ('31', 'Мороженое пломбир', '9', '2023-02-23', '500'),
    ('32', 'Мороженое лакомка', '9', '2023-03-31', '100'),
    ('33', 'Филе замороженое', '9', '2023-03-31', '400'),
    ('34', 'Пармезан', '8', '2022-04-21', '998');   

--1. Вывод всех продуктов с типом "СЫР"
SELECT 
    p.id, 
    p.name AS "Название продукта",
    t.name AS "Тип продукта", 
    p.expired_date AS "Срок годности",
    p.price AS "Стоимость"
FROM product AS p
JOIN type AS t ON p.type_id = t.id
WHERE t.name = 'Сыр';

--2. Вывод продуктов, где в названии встречается слово "Мороженое" или "мороженое"
SELECT 
    p.id, 
    p.name AS "Название продукта",
    t.name AS "Тип продукта", 
    p.expired_date AS "Срок годности",
    p.price AS "Стоимость"
FROM product AS p
JOIN type AS t ON p.type_id = t.id
WHERE p.name LIKE '%мороженое%' OR p.name LIKE 'Мороженое%';

--3. Вывод продуктов, срок годности которых истёк с сортировкой по возрастанию,
--начиная с самого старого продукта
SELECT 
    p.id, 
    p.name AS "Название продукта",
    t.name AS "Тип продукта", 
    p.expired_date AS "Срок годности",
    p.price AS "Стоимость"
FROM product AS p
JOIN type AS t ON p.type_id = t.id
WHERE p.expired_date < CURRENT_TIMESTAMP
ORDER BY p.expired_date ASC;

--4. Вывод самого дорого продукта
SELECT    
    p.id, 
    p.name AS "Название продукта",
    t.name AS "Тип продукта", 
    p.expired_date AS "Срок годности",
    p.price AS "Стоимость"
FROM product AS p
JOIN type AS t ON p.type_id = t.id
WHERE p.price = (
                SELECT MAX(product.price) 
                FROM product
                );

--5. Вывод типа продуктов с количеством продуктов, ему принадлежащему
SELECT t.name AS "Тип продукта", COUNT(*) AS "Количество наименований"
FROM product AS p
JOIN type AS t ON p.type_id = t.id
GROUP BY t.name;

--6. Вывод всех продуктов с типом "Сыр" и "Кисломолочные продукты"
SELECT 
    p.id, 
    p.name AS "Название продукта",
    t.name AS "Тип продукта", 
    p.expired_date AS "Срок годности",
    p.price AS "Стоимость"
FROM product AS p
JOIN type AS t ON p.type_id = t.id
WHERE t.name = 'Сыр' OR t.name = 'Кисломолочные продукты';

--7. Вывод продуктов продуктов, которых осталось меньше 10 штук
SELECT t.name AS "Тип продукта", COUNT(*) AS "Количество наименований"
FROM product AS p
JOIN type AS t ON p.type_id = t.id
GROUP BY t.name
HAVING COUNT(*) < 10;

--8. Общий вывод всей таблицы
SELECT 
    p.id, 
    p.name AS "Название продукта",
    t.name AS "Тип продукта", 
    p.expired_date AS "Срок годности",
    p.price AS "Стоимость"
FROM product AS p
JOIN type AS t ON p.type_id = t.id;